---
kind: other
id: Properties.T:Autodesk.Revit.DB.CurveByPointsUtils
source: html/1a818073-f268-0194-5f39-e1835f05da7e.htm
---
# CurveByPointsUtils Properties

Specifies whether the .NET object represents a valid Revit entity.